In [88]:
import numpy as np
import pandas as pd
from numpy import std, mean, sqrt

In [89]:
dataset1 = pd.read_csv('dataset1.csv') # cdt1 bimodal
dataset2 = pd.read_csv('dataset2.csv') # cdt1 unimodol, overlap control
dataset3 = pd.read_csv('dataset3.csv') # cdt1 unimodal, do not overlap control
dataset4 = pd.read_csv('dataset4.csv') # female/male IQ

In [90]:
dataset2

    pptID condition  score
0       1   control    643
1       2      cdt1    434
2       3   control    356
3       4      cdt1    587
4       5      cdt1    661
5       6   control    544
6       7   control    470
7       8      cdt1    412
8       9   control    388
9      10      cdt1    501
10     11   control    278
11     12      cdt1    599
12     13   control    366
13     14      cdt1    597
14     15      cdt1    571
15     16   control    554
16     17   control    480
17     18      cdt1    462
18     19   control    398
19     20      cdt1    371
20     21   control    288
21     22      cdt1    609
22     23   control    653
23     24      cdt1    444

In [91]:
dataset1.groupby("condition")["score"].describe()

           count   mean         std    min    25%    50%    75%    max
condition
cdt1        12.0  404.0  192.181732  201.0  219.5  402.5  589.5  609.0
control     12.0  451.5  127.083008  278.0  363.5  434.0  546.5  653.0

In [92]:
dataset2.groupby("condition")["score"].describe()

           count        mean         std    min    25%    50%    75%    max
condition
cdt1        12.0  520.666667   94.300615  371.0  441.5  536.0  597.5  661.0
control     12.0  451.500000  127.083008  278.0  363.5  434.0  546.5  653.0

In [93]:
dataset3.groupby("condition")["score"].describe()

           count        mean         std    min    25%    50%    75%    max
condition
cdt1        12.0  687.333333   81.474294  571.0  628.5  661.5  775.0  799.0
control     12.0  451.500000  127.083008  278.0  363.5  434.0  546.5  653.0

In [94]:
dataset4.groupby("gender")["iq"].describe()

        count       mean       std    min    25%    50%     75%    max
gender
female   19.0  76.640526  0.028377  76.60  76.62  76.64  76.655  76.69
male     18.0  76.535556  0.022022  76.51  76.52  76.53  76.540  76.58

In [95]:
from scipy.stats import ttest_ind, mannwhitneyu

In [96]:
def cohen_d(x,y):
    nx = len(x)
    ny = len(y)
    dof = nx + ny - 2
    return (mean(x) - mean(y)) / sqrt(((nx-1)*std(x, ddof=1) ** 2 + (ny-1)*std(y, ddof=1) ** 2) / dof)

def tests(dataset, cdt, grp1, grp2,metric):

    print("%s by %s: %s vs %s" % (metric, cdt, grp1, grp2))
    d1 = dataset[dataset[cdt] == grp1]
    d2 = dataset[dataset[cdt] == grp2]
    print(ttest_ind(d1[metric], d2[metric]))
    print("Difference of means: %.3f - %.3f = %.3f" % (d1[metric].mean(), d2[metric].mean(),d1[metric].mean() - d2[metric].mean()))
    print("Cohen's d: %.3f" % cohen_d(d1[metric], d2[metric]))

In [97]:
tests(dataset1, "condition", "control", "cdt1", "score")

score by condition: control vs cdt1
Ttest_indResult(statistic=0.7141719426715973, pvalue=0.4826300916024847)
Difference of means: 451.500 - 404.000 = 47.500
Cohen's d: 0.292

In [98]:
tests(dataset2, "condition", "control", "cdt1", "score")

score by condition: control vs cdt1
Ttest_indResult(statistic=-1.514073367107169, pvalue=0.14424264846879914)
Difference of means: 451.500 - 520.667 = -69.167
Cohen's d: -0.618

In [99]:
tests(dataset3, "condition", "control", "cdt1", "score")

score by condition: control vs cdt1
Ttest_indResult(statistic=-5.411794081080247, pvalue=1.9554482132383865e-05)
Difference of means: 451.500 - 687.333 = -235.833
Cohen's d: -2.209

In [100]:
tests(dataset4, "gender", "female", "male", "iq")

iq by gender: female vs male
Ttest_indResult(statistic=12.520657730218476, pvalue=1.740334415035795e-14)
Difference of means: 76.641 - 76.536 = 0.105
Cohen's d: 4.118

In [101]:
mannwhitneyu(control2["score"], cdt2["score"])

MannwhitneyuResult(statistic=46.0, pvalue=0.07047760957218573)

In [102]:
from scipy.stats import pearsonr

In [104]:
pearsonr(dataset1.score, dataset1.age)

(-0.021867356172261865, 0.9192165651497063)

In [105]:
pearsonr(dataset1.score, dataset1.heartrate)

(0.9811471058044936, 3.3775662971893206e-17)